package net.novemberizing.orientalism;

public class ExampleContent {
    public static String article1(){
        return "기원전 180년, 한 고조 유방의 황후인 여태후가 죽었다. 그는 고조가 죽은 뒤 혜제와 소제 뒤에서 실권을 잡고 여씨 일족에 의한 전횡을 했던 인물이다. 특히 고조의 총애를 받았던 척부인을 잔인한 방법으로 죽인 것은 유명한 이야기이다. 여태후는 병상에서 일족인 조왕 여록과 양왕 여산을 중앙의 북군과 남군을 통솔하는 상장군으로 임명하여 무역으로 여씨정권을 유지하라는 유언을 남기고 그해 7월에 죽었다.\n" +
                "\n" +
                "여태후가 죽자 그 위세에 눌려 있던 유씨 일족과 진평, 주발 등 고조의 구신들은 이 기회에 여씨 타도에 나섰다. 우선 우승상 진평은 태위 주발과 상의하여 여록이 갖고 있는 상장군의 인수를 거두기로 했다. 마침 역기가 여록과 친한 것을 알고 그를 보내 여록을 설득시키기로 했다. 역기는 여록을 찾아가 황제의 뜻이라고 설득하여 상장군의 인수를 회수해 왔다. 회수한 인수로 북군의 병권을 쥐게 된 주발은 곧 북군의 병사들을 모아놓고 이렇게 외쳤다.\n" +
                "\n" +
                "“원래 한실의 주인은 유씨이다. 무엄하게도 여씨가 유씨를 누르고 실권을 장악하고 있으니 이는 한실의 불행이 아닐 수 없다. 이제 나는 천하를 바로잡으려고 일어섰다. 여씨에게 충성하려는 자는 오른쪽 어깨를 벗고 나와 함께 유씨에게 충서하려는 자는 왼쪽 어깨를 벗으라.”\n" +
                "\n" +
                "말이 떨어지나 전군은 모두 좌단함으로써 유씨의 편을 들 것을 맹세했다. 이리하여 여산과 여록은 모두 죽임을 당하고 여씨 일족은 모조리 축출되어 천하는 다시 유씨에게로 되돌아갔다.";
    }
    public static String get() {
        return "전국시대 말경 남쪽의 대국 초나라는 동쪽의 대국 제나라와 동맹을 맺고 북의 강국 진에 대비하고 있었다. 이때 초나라가 취한 것은 합종책이었으나, 초의 국내에는 진나라와 손잡고 전국을 제패하여 천하를 분할하자는 연형책을 주장하는 세력도 만만치 않았다.\n" +
                "\n" +
                "그래서 진나라의 재상 장의는 합종파 편에 있는 대표자인 초나라의 삼려대부 굴원을 제거하기로 했다. 장의는 초나라 조정 내부에 굴원을 증오하고 있는 세력이 있다는 정보를 입수하고는, 그들을 매수하여 굴원을 실각시키는 데 성공했다.\n" +
                "\n" +
                "굴원이 물러나고 난 뒤 장의는 희왕에게 제나라와 단교하면 진나라의 땅 6백리를 주겠다고 제의했다. 욕심이 생긴 희왕은 곧 제나라와 단교했으나 정의는 약속을 이행하지 않았다. 그러다 장의는 제나라가 초나라의 국교 단절에 분노하고 있다는 것을 확인한 뒤에야 초나라의 사자에게 ‘약속한 땅 6리를 내주겠다’고 엉뚱한 소리를 했다. 속은 것을 안 희왕은 분을 참지 못해 진나라로 쳐들어갔으나 대패하고 말았다. 희왕은 지난 일을 후회하고 굴원을 다시 등용했다.\n" +
                "\n" +
                "10년이 지난 후 진나라에서는 빼앗은 영토를 반환해 줄 것처럼 하며 희왕을 초청해 왔다. 굴원은 믿을 수 없다면서 반대했으나, 희왕은 어리석게도 진나라의 초청에 응했다가 그대로 붙잡혀 결국 객사하고 말았다.\n" +
                "\n" +
                "희왕이 진에 잡힌 것이 알려지자 초나라에서는 태자가 왕위에 오르고 동생인 자란이 재상이 되었다. 굴원은 자란이 연형파의 우두머리로서 결과적으로 희왕을 죽음으로 몰아넣은 인물이라고 그를 매우 미워했으나, 도리어 자란에 의해 참소를 당해 또다시 추방당하고 말았다.\n" +
                "\n" +
                "그 후 그는 10여 년 간 오직 조국을 걱정하면서 망명도 하지 않고 동정호 주변을 방랑하다가 마침내 절망 끝에 멱라수에 몸을 던져 묵고 말았다. 초나라는 그후에도 진의 압박을 받은 끝에 결국 멸망했다.\n" +
                "\n" +
                "‘초사’에 실려 있는 굴원의 작품 중 대부분은 이 방랑 시절에 쓰여진 것으로서, 그의 글은 이 시절 그의 열렬한 조국애와 비분강개의 심정을 그리고 있다. 이 ‘징갱취제(懲羹吹韲)’란 말은 ‘초사’ 9장 중 ‘석송’이란 작품의 첫 구절이다.\n" +
                "\n" +
                "懲於羹者而吹齏兮，何不變此志也\n" +
                "\n" +
                "뜨거운 국에 데어서 냉채까지 부는구나, 어찌 이 생각을 바꾸지 않는가\n" +
                "\n" +
                "이 시는 조정에 자기만큼 임금을 생각하고 나라를 걱정하는 자가 없음을 슬퍼하고, 그럼에도 불구하고 추방당한 자신의 처디와 고독에 분노하고 한탄하면서도 그 절조는 변하지 않겠다는 마음을 그린 시이다.";
    }
}
